Repository: ayo-eyo/LiftLog
Catalog: LiftLog/Catalog/ExerciseNames.xcstrings
Source language: en
Languages: ru

source: Keg Load
ru: Погрузка бочки

source: Kettlebell Arnold Press
ru: Жим Арнольда с гирями

source: Kettlebell Dead Clean
ru: Взятие гири на грудь с пола

source: Kettlebell Figure 8
ru: Восьмёрка с гирей

source: Kettlebell Hang Clean
ru: Взятие гири на грудь с виса

source: Kettlebell One-Legged Deadlift
ru: Становая тяга с гирей на одной ноге

source: Kettlebell Pass Between The Legs
ru: Передача гири между ногами

source: Kettlebell Pirate Ships
ru: «Пиратские корабли» с гирей

source: Kettlebell Pistol Squat
ru: Пистолетик с гирей

source: Kettlebell Seated Press
ru: Жим гири сидя

source: Kettlebell Seesaw Press
ru: Попеременный жим гирь «качели»

source: Kettlebell Sumo High Pull
ru: Тяга гири к подбородку в стойке сумо

source: Kettlebell Thruster
ru: Трастер с гирей

source: Kettlebell Turkish Get-Up (Lunge style)
ru: Турецкий подъём с гирей (через выпад)

source: Kettlebell Turkish Get-Up (Squat style)
ru: Турецкий подъём с гирей (через присед)

source: Kettlebell Windmill
ru: Мельница с гирей

source: Kipping Muscle Up
ru: Выход силой с раскачкой

source: Knee Across The Body
ru: Колено через корпус

source: Knee Circles
ru: Вращения коленями

source: Knee/Hip Raise On Parallel Bars
ru: Подъём коленей на брусьях

source: Knee Tuck Jump
ru: Прыжки с подтягиванием коленей

source: Kneeling Arm Drill
ru: Работа руками стоя на коленях

source: Kneeling Cable Crunch With Alternating Oblique Twists
ru: Скручивания на блоке на коленях с попеременными поворотами

source: Kneeling Cable Triceps Extension
ru: Разгибания на трицепс на блоке на коленях

source: Kneeling Forearm Stretch
ru: Растяжка предплечий на коленях

source: Kneeling High Pulley Row
ru: Тяга верхнего блока на коленях

source: Kneeling Hip Flexor
ru: Растяжка сгибателей бедра на коленях

source: Kneeling Jump Squat
ru: Выпрыгивание из положения на коленях

source: Kneeling Single-Arm High Pulley Row
ru: Тяга верхнего блока одной рукой на коленях

source: Kneeling Squat
ru: Приседания на коленях

source: Landmine 180's
ru: Повороты с упором штанги в угол (180°)

source: Landmine Linear Jammer
ru: Толчок штанги в упоре от пола

source: Lateral Bound
ru: Прыжки в сторону с ноги на ногу

source: Lateral Box Jump
ru: Боковые прыжки на тумбу

source: Lateral Cone Hops
ru: Боковые прыжки через конусы

source: Lateral Raise - With Bands
ru: Махи в стороны с резинками

source: Latissimus Dorsi-SMR
ru: Широчайшая — самомассаж

source: Leg-Over Floor Press
ru: Жим с пола с ногой через ногу

source: Leg-Up Hamstring Stretch
ru: Растяжка бицепса бедра с поднятой ногой

source: Leg Extensions
ru: Разгибания ног в тренажёре

source: Leg Lift
ru: Подъём ноги

source: Leg Press
ru: Жим ногами

source: Leg Pull-In
ru: Подтягивание ног к груди

source: Leverage Chest Press
ru: Жим от груди в рычажном тренажёре

source: Leverage Deadlift
ru: Становая тяга в рычажном тренажёре

source: Leverage Decline Chest Press
ru: Жим от груди в рычажном тренажёре с обратным наклоном

source: Leverage High Row
ru: Верхняя тяга в рычажном тренажёре

source: Leverage Incline Chest Press
ru: Жим от груди в рычажном тренажёре под наклоном

source: Leverage Iso Row
ru: Изолированная тяга в рычажном тренажёре

source: Leverage Shoulder Press
ru: Жим от плеч в рычажном тренажёре

source: Leverage Shrug
ru: Шраги в рычажном тренажёре

source: Linear 3-Part Start Technique
ru: Техника старта в три фазы

source: Linear Acceleration Wall Drill
ru: Упражнение у стены на линейное ускорение

source: Linear Depth Jump
ru: Прыжок в глубину

source: Log Lift
ru: Подъём бревна

source: London Bridges
ru: «Лондонские мосты» на канате

source: Looking At Ceiling
ru: Взгляд в потолок (растяжка шеи)

source: Low Cable Crossover
ru: Сведение рук в кроссовере снизу

source: Low Cable Triceps Extension
ru: Разгибания на трицепс с нижнего блока

source: Low Pulley Row To Neck
ru: Тяга нижнего блока к шее

source: Lower Back-SMR
ru: Поясница — самомассаж

source: Lower Back Curl
ru: Скручивание поясницы

source: Lunge Pass Through
ru: Выпад с передачей

source: Lunge Sprint
ru: Выпады с ускорением

source: Lying Bent Leg Groin
ru: Растяжка паха лёжа с согнутыми ногами

source: Lying Cable Curl
ru: Сгибания на блоке лёжа

source: Lying Cambered Barbell Row
ru: Тяга изогнутой штанги лёжа на скамье

source: Lying Close-Grip Bar Curl On High Pulley
ru: Сгибания с верхнего блока лёжа узким хватом

source: Lying Close-Grip Barbell Triceps Extension Behind The Head
ru: Французский жим штанги из-за головы лёжа узким хватом

source: Lying Close-Grip Barbell Triceps Press To Chin
ru: Жим штанги узким хватом лёжа к подбородку

source: Lying Crossover
ru: Растяжка с перекрёстом лёжа

source: Lying Dumbbell Tricep Extension
ru: Разгибание гантели на трицепс лёжа

source: Lying Face Down Plate Neck Resistance
ru: Сопротивление шеи с блином лёжа на животе

source: Lying Face Up Plate Neck Resistance
ru: Сопротивление шеи с блином лёжа на спине

source: Lying Glute
ru: Растяжка ягодиц лёжа

source: Lying Hamstring
ru: Растяжка бицепса бедра лёжа

source: Lying High Bench Barbell Curl
ru: Сгибания со штангой лёжа на высокой скамье

source: Lying Leg Curls
ru: Сгибания ног лёжа

source: Lying Machine Squat
ru: Приседания в тренажёре лёжа

source: Lying One-Arm Lateral Raise
ru: Отведение руки лёжа на боку

source: Lying Prone Quadriceps
ru: Растяжка квадрицепса лёжа на животе

source: Lying Rear Delt Raise
ru: Разведение лёжа на задние дельты

source: Lying Supine Dumbbell Curl
ru: Сгибания с гантелями лёжа на спине

source: Lying T-Bar Row
ru: Тяга Т-грифа лёжа

source: Lying Triceps Press
ru: Французский жим лёжа

source: Machine Bench Press
ru: Жим от груди в тренажёре

source: Machine Bicep Curl
ru: Сгибания рук в тренажёре

source: Machine Preacher Curls
ru: Сгибания на скамье Скотта в тренажёре

source: Machine Shoulder (Military) Press
ru: Жим от плеч в тренажёре (армейский)

source: Machine Triceps Extension
ru: Разгибания на трицепс в тренажёре

source: Medicine Ball Chest Pass
ru: Пас медболом от груди

source: Medicine Ball Full Twist
ru: Полный поворот с медболом

source: Medicine Ball Scoop Throw
ru: Бросок медбола снизу

source: Middle Back Shrug
ru: Шраги для середины спины

source: Middle Back Stretch
ru: Растяжка середины спины

source: Mixed Grip Chin
ru: Подтягивания разнохватом

source: Monster Walk
ru: «Монстр-шаги» с резинкой

source: Mountain Climbers
ru: Скалолаз

source: Moving Claw Series
ru: Серия «движущаяся лапа»

source: Muscle Snatch
ru: Силовой рывок без подседа

source: Muscle Up
ru: Выход силой

source: Narrow Stance Hack Squats
ru: Гакк-приседания в узкой стойке

source: Narrow Stance Leg Press
ru: Жим ногами в узкой стойке

source: Narrow Stance Squats
ru: Приседания в узкой стойке

source: Natural Glute Ham Raise
ru: Подъём корпуса на бицепс бедра без тренажёра

source: Neck-SMR
ru: Шея — самомассаж

source: Neck Press
ru: Жим штанги к шее

source: Oblique Crunches
ru: Косые скручивания

source: Oblique Crunches - On The Floor
ru: Косые скручивания на полу

source: Olympic Squat
ru: Олимпийские приседания

source: On-Your-Back Quad Stretch
ru: Растяжка квадрицепса лёжа на спине

source: On Your Side Quad Stretch
ru: Растяжка квадрицепса лёжа на боку

source: One-Arm Dumbbell Row
ru: Тяга гантели одной рукой

source: One-Arm Flat Bench Dumbbell Flye
ru: Разводка гантели одной рукой на горизонтальной скамье

source: One-Arm High-Pulley Cable Side Bends
ru: Наклоны в сторону с верхнего блока одной рукой

source: One-Arm Incline Lateral Raise
ru: Отведение руки лёжа на наклонной скамье

source: One-Arm Kettlebell Clean
ru: Взятие гири на грудь одной рукой

source: One-Arm Kettlebell Clean and Jerk
ru: Взятие на грудь и толчок гири одной рукой

source: One-Arm Kettlebell Floor Press
ru: Жим гири с пола одной рукой

source: One-Arm Kettlebell Jerk
ru: Толчок гири одной рукой

source: One-Arm Kettlebell Military Press To The Side
ru: Армейский жим гири одной рукой с наклоном в сторону

source: One-Arm Kettlebell Para Press
ru: Жим гири одной рукой из-под руки

source: One-Arm Kettlebell Push Press
ru: Швунг гири одной рукой

source: One-Arm Kettlebell Row
ru: Тяга гири одной рукой

source: One-Arm Kettlebell Snatch
ru: Рывок гири одной рукой

source: One-Arm Kettlebell Split Jerk
ru: Толчок гири одной рукой в ножницы

source: One-Arm Kettlebell Split Snatch
ru: Рывок гири одной рукой в ножницы

source: One-Arm Kettlebell Swings
ru: Махи гирей одной рукой

source: One-Arm Long Bar Row
ru: Тяга Т-грифа одной рукой

source: One-Arm Medicine Ball Slam
ru: Бросок медбола в пол одной рукой

source: One-Arm Open Palm Kettlebell Clean
ru: Взятие гири на грудь одной рукой открытой ладонью

source: One-Arm Overhead Kettlebell Squats
ru: Приседания с гирей над головой в одной руке

source: One-Arm Side Deadlift
ru: Становая тяга сбоку одной рукой

source: One-Arm Side Laterals
ru: Махи гантелью в сторону одной рукой

source: One-Legged Cable Kickback
ru: Отведение ноги назад на блоке

source: One Arm Against Wall
ru: Растяжка одной руки у стены

source: One Arm Chin-Up
ru: Подтягивания на одной руке

source: One Arm Dumbbell Bench Press
ru: Жим гантели лёжа одной рукой

source: One Arm Dumbbell Preacher Curl
ru: Сгибания гантели на скамье Скотта одной рукой

source: One Arm Floor Press
ru: Жим с пола одной рукой

source: One Arm Lat Pulldown
ru: Тяга верхнего блока одной рукой

source: One Arm Pronated Dumbbell Triceps Extension
ru: Разгибание гантели на трицепс одной рукой прямым хватом

source: One Arm Supinated Dumbbell Triceps Extension
ru: Разгибание гантели на трицепс одной рукой обратным хватом

source: One Half Locust
ru: Полусаранча

source: One Handed Hang
ru: Вис на одной руке

source: One Knee To Chest
ru: Одно колено к груди

source: One Leg Barbell Squat
ru: Приседания со штангой на одной ноге

source: Open Palm Kettlebell Clean
ru: Взятие гири на грудь открытой ладонью

source: Otis-Up
ru: Подъём Отиса

source: Overhead Cable Curl
ru: Сгибания рук на верхних блоках

source: Overhead Lat
ru: Растяжка широчайших над головой

source: Overhead Slam
ru: Бросок мяча в пол из-за головы

source: Overhead Squat
ru: Приседания со штангой над головой

source: Overhead Stretch
ru: Растяжка с руками над головой

source: Overhead Triceps
ru: Растяжка трицепса над головой

source: Pallof Press
ru: Жим Паллофа

source: Pallof Press With Rotation
ru: Жим Паллофа с поворотом

source: Palms-Down Dumbbell Wrist Curl Over A Bench
ru: Сгибания запястий с гантелью ладонями вниз через скамью

source: Palms-Down Wrist Curl Over A Bench
ru: Сгибания запястий ладонями вниз через скамью

source: Palms-Up Barbell Wrist Curl Over A Bench
ru: Сгибания запястий со штангой ладонями вверх через скамью

source: Palms-Up Dumbbell Wrist Curl Over A Bench
ru: Сгибания запястий с гантелью ладонями вверх через скамью

source: Parallel Bar Dip
ru: Отжимания на брусьях

source: Pelvic Tilt Into Bridge
ru: Наклон таза с переходом в мостик

source: Peroneals-SMR
ru: Малоберцовые мышцы — самомассаж

source: Peroneals Stretch
ru: Растяжка малоберцовых мышц

source: Physioball Hip Bridge
ru: Ягодичный мостик на фитболе

source: Pin Presses
ru: Жим штанги от упоров

source: Piriformis-SMR
ru: Грушевидная мышца — самомассаж

source: Plank
ru: Планка

source: Plate Pinch
ru: Удержание блинов щипковым хватом

source: Plate Twist
ru: Скручивания с блином

source: Platform Hamstring Slides
ru: Сгибания ног скольжением по платформе

source: Plie Dumbbell Squat
ru: Приседания плие с гантелью

source: Plyo Kettlebell Pushups
ru: Плиометрические отжимания от гирь

source: Plyo Push-up
ru: Плиометрические отжимания

source: Posterior Tibialis Stretch
ru: Растяжка задней большеберцовой мышцы

source: Power Clean
ru: Силовое взятие на грудь

source: Power Clean from Blocks
ru: Силовое взятие на грудь с блоков

source: Power Jerk
ru: Силовой толчок

source: Power Partials
ru: Силовые частичные повторения

source: Power Snatch
ru: Силовой рывок

source: Power Snatch from Blocks
ru: Силовой рывок с блоков

source: Power Stairs
ru: Силовая лестница

source: Preacher Curl
ru: Сгибания на скамье Скотта

source: Preacher Hammer Dumbbell Curl
ru: Сгибания «молот» с гантелью на скамье Скотта

source: Press Sit-Up
ru: Подъём корпуса с жимом

source: Prone Manual Hamstring
ru: Растяжка бицепса бедра лёжа с партнёром

source: Prowler Sprint
ru: Спринт с толканием саней

source: Pull Through
ru: Протяжка между ног на блоке (пулл-сру)

source: Pullups
ru: Подтягивания

source: Push-Up Wide
ru: Отжимания широким хватом

source: Push-Ups - Close Triceps Position
ru: Отжимания узким хватом на трицепс

source: Push-Ups With Feet Elevated
ru: Отжимания с ногами на возвышении

source: Push-Ups With Feet On An Exercise Ball
ru: Отжимания с ногами на фитболе

source: Push Press
ru: Швунг

source: Push Press - Behind the Neck
ru: Швунг из-за головы

source: Push Up to Side Plank
ru: Отжимание с переходом в боковую планку

source: Pushups
ru: Отжимания

source: Pushups (Close and Wide Hand Positions)
ru: Отжимания (узкая и широкая постановка рук)

source: Pyramid
ru: Пирамида (растяжка)

source: Quad Stretch
ru: Растяжка квадрицепса

source: Quadriceps-SMR
ru: Квадрицепс — самомассаж

source: Quick Leap
ru: Быстрый прыжок

source: Rack Delivery
ru: Подача на стойку

source: Rack Pull with Bands
ru: Тяга с плинтов с резинками

source: Rack Pulls
ru: Тяга с плинтов

source: Rear Leg Raises
ru: Махи ногой назад

source: Recumbent Bike
ru: Горизонтальный велотренажёр

source: Return Push from Stance
ru: Возвратный толчок из стойки

source: Reverse Band Bench Press
ru: Жим лёжа с обратными резинками

source: Reverse Band Box Squat
ru: Приседания на тумбу с обратными резинками

source: Reverse Band Deadlift
ru: Становая тяга с обратными резинками

source: Reverse Band Power Squat
ru: Силовые приседания с обратными резинками

source: Reverse Band Sumo Deadlift
ru: Становая тяга сумо с обратными резинками

source: Reverse Barbell Curl
ru: Сгибания со штангой обратным хватом

source: Reverse Barbell Preacher Curls
ru: Сгибания со штангой на скамье Скотта обратным хватом

source: Reverse Cable Curl
ru: Сгибания на блоке обратным хватом

source: Reverse Crunch
ru: Обратные скручивания

source: Reverse Flyes
ru: Разведение рук в наклоне

source: Reverse Flyes With External Rotation
ru: Разведение рук в наклоне с наружной ротацией

source: Reverse Grip Bent-Over Rows
ru: Тяга в наклоне обратным хватом

source: Reverse Grip Triceps Pushdown
ru: Разгибания на трицепс на блоке обратным хватом

source: Reverse Hyperextension
ru: Обратная гиперэкстензия

source: Reverse Machine Flyes
ru: Обратная разводка в тренажёре

source: Reverse Plate Curls
ru: Сгибания с блином обратным хватом

source: Reverse Triceps Bench Press
ru: Жим лёжа на трицепс обратным хватом

source: Rhomboids-SMR
ru: Ромбовидные мышцы — самомассаж

source: Rickshaw Carry
ru: Переноска рикши

source: Rickshaw Deadlift
ru: Становая тяга рикши

source: Ring Dips
ru: Отжимания на кольцах

source: Rocket Jump
ru: Прыжок «ракета»

source: Rocking Standing Calf Raise
ru: Подъём на носки стоя с раскачкой

source: Rocky Pull-Ups/Pulldowns
ru: Подтягивания / тяга верхнего блока «Рокки»

source: Romanian Deadlift
ru: Румынская тяга

source: Romanian Deadlift from Deficit
ru: Румынская тяга с дефицитом

source: Rope Climb
ru: Лазание по канату

source: Rope Crunch
ru: Скручивания с канатом

source: Rope Jumping
ru: Прыжки через скакалку

source: Rope Straight-Arm Pulldown
ru: Тяга каната прямыми руками с верхнего блока

source: Round The World Shoulder Stretch
ru: Растяжка плеч «вокруг света»

source: Rowing, Stationary
ru: Гребной тренажёр

source: Runner's Stretch
ru: Растяжка бегуна

source: Running, Treadmill
ru: Бег на дорожке

source: Russian Twist
ru: Русские скручивания

source: Sandbag Load
ru: Погрузка мешка с песком

source: Scapular Pull-Up
ru: Подтягивания на лопатках

source: Scissor Kick
ru: Ножницы ногами

source: Scissors Jump
ru: Прыжки «ножницы»

source: Seated Band Hamstring Curl
ru: Сгибания ног с резинкой сидя

source: Seated Barbell Military Press
ru: Армейский жим штанги сидя

source: Seated Barbell Twist
ru: Скручивания со штангой сидя

source: Seated Bent-Over One-Arm Dumbbell Triceps Extension
ru: Разгибание гантели одной рукой на трицепс сидя в наклоне

source: Seated Bent-Over Rear Delt Raise
ru: Разведение в наклоне сидя на задние дельты

source: Seated Bent-Over Two-Arm Dumbbell Triceps Extension
ru: Разгибание гантели двумя руками на трицепс сидя в наклоне

source: Seated Biceps
ru: Растяжка бицепса сидя

source: Seated Cable Rows
ru: Тяга нижнего блока сидя

source: Seated Cable Shoulder Press
ru: Жим от плеч на блоке сидя

source: Seated Calf Raise
ru: Подъём на носки сидя

source: Seated Calf Stretch
ru: Растяжка икр сидя

source: Seated Close-Grip Concentration Barbell Curl
ru: Концентрированные сгибания со штангой сидя узким хватом

source: Seated Dumbbell Curl
ru: Сгибания с гантелями сидя

source: Seated Dumbbell Inner Biceps Curl
ru: Сгибания с гантелями сидя с разведением рук

source: Seated Dumbbell Palms-Down Wrist Curl
ru: Сгибания запястий с гантелями сидя ладонями вниз

source: Seated Dumbbell Palms-Up Wrist Curl
ru: Сгибания запястий с гантелями сидя ладонями вверх

source: Seated Dumbbell Press
ru: Жим гантелей сидя

source: Seated Flat Bench Leg Pull-In
ru: Подтягивание ног к груди сидя на скамье

source: Seated Floor Hamstring Stretch
ru: Растяжка бицепса бедра сидя на полу

source: Seated Front Deltoid
ru: Растяжка передней дельты сидя

source: Seated Glute
ru: Растяжка ягодиц сидя

source: Seated Good Mornings
ru: Наклоны со штангой сидя (гуд морнинг)

source: Seated Hamstring
ru: Растяжка бицепса бедра сидя

source: Seated Hamstring and Calf Stretch
ru: Растяжка бицепса бедра и икр сидя

source: Seated Head Harness Neck Resistance
ru: Сопротивление шеи с упряжью сидя

source: Seated Leg Curl
ru: Сгибания ног сидя

source: Seated Leg Tucks
ru: Подтягивание коленей сидя

source: Seated One-Arm Dumbbell Palms-Down Wrist Curl
ru: Сгибания запястья с гантелью одной рукой сидя ладонью вниз

source: Seated One-Arm Dumbbell Palms-Up Wrist Curl
ru: Сгибания запястья с гантелью одной рукой сидя ладонью вверх

source: Seated One-arm Cable Pulley Rows
ru: Тяга нижнего блока одной рукой сидя

source: Seated Overhead Stretch
ru: Растяжка над головой сидя

source: Seated Palm-Up Barbell Wrist Curl
ru: Сгибания запястий со штангой сидя ладонями вверх

source: Seated Palms-Down Barbell Wrist Curl
ru: Сгибания запястий со штангой сидя ладонями вниз

source: Seated Side Lateral Raise
ru: Махи гантелями в стороны сидя

source: Seated Triceps Press
ru: Жим на трицепс сидя

source: Seated Two-Arm Palms-Up Low-Pulley Wrist Curl
ru: Сгибания запястий с нижнего блока сидя ладонями вверх

source: See-Saw Press (Alternating Side Press)
ru: Попеременный жим в сторону «качели»

source: Shotgun Row
ru: Тяга «дробовик»

source: Shoulder Circles
ru: Вращения плечами

source: Shoulder Press - With Bands
ru: Жим от плеч с резинками

source: Shoulder Raise
ru: Подъём плеч

source: Shoulder Stretch
ru: Растяжка плеч

source: Side-Lying Floor Stretch
ru: Растяжка лёжа на боку на полу

source: Side Bridge
ru: Боковая планка

source: Side Hop-Sprint
ru: Прыжки в сторону с ускорением

source: Side Jackknife
ru: Боковая складка

source: Side Lateral Raise
ru: Махи гантелями в стороны

source: Side Laterals to Front Raise
ru: Махи в стороны с переходом в подъём перед собой

source: Side Leg Raises
ru: Махи ногами в сторону

source: Side Lying Groin Stretch
ru: Растяжка паха лёжа на боку

source: Side Neck Stretch
ru: Растяжка шеи в сторону

source: Side Standing Long Jump
ru: Прыжок в длину боком с места

source: Side To Side Chins
ru: Подтягивания со смещением в стороны

source: Side Wrist Pull
ru: Отведение запястья в сторону

source: Side to Side Box Shuffle
ru: Приставные шаги у тумбы из стороны в сторону

source: Single-Arm Cable Crossover
ru: Сведение одной руки в кроссовере

source: Single-Arm Linear Jammer
ru: Толчок штанги в упоре одной рукой

source: Single-Arm Push-Up
ru: Отжимания на одной руке

source: Single-Cone Sprint Drill
ru: Спринт вокруг одного конуса

source: Single-Leg High Box Squat
ru: Приседания на одной ноге на высокую тумбу

source: Single-Leg Hop Progression
ru: Прыжки на одной ноге с усложнением

source: Single-Leg Lateral Hop
ru: Боковые прыжки на одной ноге

source: Single-Leg Leg Extension
ru: Разгибание одной ноги в тренажёре

source: Single-Leg Stride Jump
ru: Прыжок с выпадом на одной ноге

source: Single Dumbbell Raise
ru: Подъём одной гантели

source: Single Leg Butt Kick
ru: Захлёст голени одной ногой

source: Single Leg Glute Bridge
ru: Ягодичный мостик на одной ноге

source: Single Leg Push-off
ru: Отталкивание одной ногой

source: Sit-Up
ru: Подъём корпуса

source: Sit Squats
ru: Приседания на стул сидя

source: Skating
ru: Конькобежец

source: Sled Drag - Harness
ru: Тяга саней в упряжи

source: Sled Overhead Backward Walk
ru: Ходьба назад с санями с руками над головой

source: Sled Overhead Triceps Extension
ru: Разгибания на трицепс из-за головы с санями

source: Sled Push
ru: Тяга саней вперёд

source: Sled Reverse Flye
ru: Обратная разводка с санями

source: Sled Row
ru: Тяга саней к поясу

source: Sledgehammer Swings
ru: Удары кувалдой

source: Smith Incline Shoulder Raise
ru: Подъём плеч в Смите на наклонной скамье

source: Smith Machine Behind the Back Shrug
ru: Шраги за спиной в Смите

source: Smith Machine Bench Press
ru: Жим лёжа в Смите

source: Smith Machine Bent Over Row
ru: Тяга в наклоне в Смите

source: Smith Machine Calf Raise
ru: Подъём на носки в Смите

source: Smith Machine Close-Grip Bench Press
ru: Жим лёжа узким хватом в Смите

source: Smith Machine Decline Press
ru: Жим в Смите с отрицательным наклоном

source: Smith Machine Hang Power Clean
ru: Силовое взятие на грудь с виса в Смите

source: Smith Machine Hip Raise
ru: Подъём таза в Смите

source: Smith Machine Incline Bench Press
ru: Жим в Смите на наклонной скамье

source: Smith Machine Leg Press
ru: Жим ногами в Смите

source: Smith Machine One-Arm Upright Row
ru: Тяга к подбородку одной рукой в Смите

source: Smith Machine Overhead Shoulder Press
ru: Жим над головой в Смите

source: Smith Machine Pistol Squat
ru: Пистолетик в Смите

source: Smith Machine Reverse Calf Raises
ru: Подъём носков в Смите

source: Smith Machine Squat
ru: Приседания в Смите

source: Smith Machine Stiff-Legged Deadlift
ru: Становая тяга на прямых ногах в Смите

source: Smith Machine Upright Row
ru: Тяга к подбородку в Смите

source: Smith Single-Leg Split Squat
ru: Болгарские сплит-приседания в Смите

source: Snatch
ru: Рывок

source: Snatch Balance
ru: Уход в сед для рывка

source: Snatch Deadlift
ru: Становая тяга для рывка

source: Snatch Pull
ru: Тяга для рывка

source: Snatch Shrug
ru: Шраги для рывка

source: Snatch from Blocks
ru: Рывок с блоков

source: Speed Band Overhead Triceps
ru: Скоростные разгибания на трицепс с резинкой из-за головы

source: Speed Box Squat
ru: Скоростные приседания на тумбу

source: Speed Squats
ru: Скоростные приседания

source: Spell Caster
ru: Заклинатель (с гантелями)

source: Spider Crawl
ru: Паучья ходьба

source: Spider Curl
ru: Паучьи сгибания

source: Spinal Stretch
ru: Растяжка позвоночника

source: Split Clean
ru: Взятие на грудь в ножницы

source: Split Jerk
ru: Толчок в ножницы

source: Split Jump
ru: Прыжки со сменой ног в выпаде

source: Split Snatch
ru: Рывок в ножницы

source: Split Squat with Dumbbells
ru: Сплит-приседания с гантелями

source: Split Squats
ru: Сплит-приседания

source: Squat Jerk
ru: Толчок в присед

source: Squat with Bands
ru: Приседания с резинками

source: Squat with Chains
ru: Приседания с цепями

source: Squat with Plate Movers
ru: Приседания с переносом блинов

source: Squats - With Bands
ru: Приседания с резинкой

source: Stairmaster
ru: Степпер
